wegam/STM32F1xWorkSpace/Examples/WOW/AMP_CAB.C
    if(SWITCHID_ReadLeft(&stCbSwitch)&0x80)
    {
      MainFlag=1; //0--副柜，1--主柜
    }
    else
    {
      MainFlag=0; //0--副柜，1--主柜
    }
    if(cabaddrbac!=CabAddr)
    {
      AMPCABCOMM_Configuration();   //通讯配置
    }
  }
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AMPCAB_SYSLED(void)
{
  if(0==AMPPro.Time.SYSLEDTime)
  {    
    GPIO_Toggle	(SYSLEDPort,SYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
    if(CabAddr)   //已拨码，频率1Hz
    {
      AMPPro.Time.SYSLEDTime=500;
    }
    else          //未拨码，频率5Hz
    {
      AMPPro.Time.SYSLEDTime=100;
    }
  }
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_BackLight(void)
{
  static unsigned short BLtime=0;
  if(0==CabAddr)   //未拨码
  {    
    if(BLtime++>200)
    {
      BLtime=0;
      GPIO_Toggle	(BackLightPort,BackLightPin);		//将GPIO相应管脚输出翻转----V20170605
    }
    return;
  }
  if(AMPPro.Req.BLon)      //背光开关控制
  {
    BackLightOn;
    AMPPro.Req.BLon=0;
  }
  else if(AMPPro.Req.BLoff)
  {
    BackLightOff;
    AMPPro.Req.BLoff=0;
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void LockServer(void)
{
    //-----------------------------------未拨码自动开锁
    if(0  ==  CabAddr)    //未拨码--自动开锁
    {
      if(GetLockSts)  //如果锁为关闭状态，则开锁
      {
        UnLock;
      }
      else
      {
        ResLock;
      }
      return;
    }
    //-----------------------------------正在执行开锁动作
    if(1==AMPPro.Req.unlockrun)   //正在执行开锁动作
    {
      if(AMPPro.Time.LockTime>unlockOuttime-10)//10ms后开始检查锁状态
      {
        return;
      }
      if(GetLockSts)    //锁未开
      {
        AMPPro.Sta.lockstd  = 1;    //锁状态为ON--锁住
        if(AMPPro.Time.LockTime==0) //超过开锁时间
        {
          AMPPro.Req.unlockrun  = 0;  //开锁标志关闭
          AMPPro.Sta.unlockerr  = 1;  //开锁异常
          AMPPro.Time.LockTime  = 0;  //开锁时间清除
          ResLock;
        }
      }
      //----------------------------锁已打开，需要延时关闭锁驱动
      else
      {
        if(0==AMPPro.Req.reslockqust) //延时释放锁驱动
        {
          AMPPro.Req.reslockqust  = 1;  //释放锁驱动请求
          AMPPro.Time.LockTime    = reslockdelaytime;  //延时Nms
        }
        else
        {
          if(0==AMPPro.Time.LockTime)//延时计时时间到
          {
            AMPPro.Sta.lockstd    = 0;  //锁状态为打开
            AMPPro.Req.unlockrun  = 0;
            AMPPro.Req.reslockqust= 0;  //释放锁驱动请求标志清除
            AMPPro.Sta.unlockerr  = 0;
            AMPPro.Time.LockTime  = 0;
            ResLock;
          }
        }                
      }      
    }
    //-----------------------------------有开锁请求时数据处理
    if(1==AMPPro.Req.unlockqust)  //开锁请求
    {
      AMPPro.Req.unlockrun  = 1;
      AMPPro.Req.unlockqust = 0;
      AMPPro.Req.reslock    = 0;
      AMPPro.Req.reslockqust=0;   //释放锁驱动请求标志清除
      AMPPro.Sta.unlockerr  = 0;
      
      
      AMPPro.Req.BLon=1;   //开锁需要开背光
      AMPPro.Req.PLon=1;   //开锁层板需要供电
      
      AMPPro.Time.LockTime   = unlockOuttime;    //开锁超时倒计时时间
      UnLock;
    }
    
    //-----------------------------关锁动作
    if(GetLockSts)    //锁未开
    {
      //检查是否为关锁动作
      if(0==AMPPro.Sta.lockstd)//原状态为锁已打开
      {
        AMPPro.Req.BLoff = 1;  //请求关背光
        AMPPro.Req.PLoff = 1;  //请求关闭层板电源
        AMPPro.Flag.LayPownOn=0; 
      }
      AMPPro.Sta.lockstd  = 1;
    }
    else
    {
      if(1==AMPPro.Sta.lockstd) //原状态锁为关闭---手动开锁
      {
        AMPPro.Req.BLon = 1;  //请求打开背光
        AMPPro.Req.PLon = 1;  //请求打开层板电源
        AMPPro.Flag.LayPownOn=1;
      }
      AMPPro.Sta.lockstd  = 0;
    }
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AMPCABSwitchID_Configuration(void)
{
  stCbSwitch.NumOfSW	=	8;
  
  stCbSwitch.SW1_PORT	=	GPIOC;
  stCbSwitch.SW1_Pin	=	GPIO_Pin_0;
  
  stCbSwitch.SW2_PORT	=	GPIOC;
  stCbSwitch.SW2_Pin	=	GPIO_Pin_1;
  
  stCbSwitch.SW3_PORT	=	GPIOC;
  stCbSwitch.SW3_Pin	=	GPIO_Pin_2;
  
  stCbSwitch.SW4_PORT	=	GPIOC;
  stCbSwitch.SW4_Pin	=	GPIO_Pin_3;
  
  stCbSwitch.SW5_PORT	=	GPIOC;
  stCbSwitch.SW5_Pin	=	GPIO_Pin_4;
  
  stCbSwitch.SW6_PORT	=	GPIOC;
  stCbSwitch.SW6_Pin	=	GPIO_Pin_5;
  
  stCbSwitch.SW7_PORT	=	GPIOC;
  stCbSwitch.SW7_Pin	=	GPIO_Pin_6;
  
  stCbSwitch.SW8_PORT	=	GPIOC;
  stCbSwitch.SW8_Pin	=	GPIO_Pin_7;

	SwitchIdInitialize(&stCbSwitch);						//

  CabAddr  = SWITCHID_ReadLeft(&stCbSwitch)&0x3F;  
  
  if(SWITCHID_ReadLeft(&stCbSwitch)&0x80)
  {
    MainFlag=1; //0--副柜，1--主柜
  }
  else
  {
    MainFlag=0; //0--副柜，1--主柜
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_GenyConfiguration(void)
{
  //---------------------锁接口配置
  GPIO_Configuration_OPP50(LockDrPort,LockDrPin);
  GPIO_Configuration_IPU(LockSiPort,LockSiPin);
  ResLock;    //释放锁驱动
  //---------------------背光接口配置
  GPIO_Configuration_OPP50(BackLightPort,BackLightPin);
  BackLightOn;
  //---------------------层板供电接口配置
  GPIO_Configuration_OPP50(LayPowerPort,LayPowerPin);
  LayPowerOn;   //开供电，配置读卡器
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCABCOMM_Configuration(void)
{
  //-----------------------------PC接口USART1
  USART_DMA_ConfigurationNR	(USART1,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断
  
